{
    "about_me": "ABOUT ME",
    "technologies_navbar": "TECHNOLOGIES",
    "contact": "CONTACT",
    "hello_me": "Hey, I'm",
    "read_a_blog": "Read a Blog",
    "about_info": "Hey, I am Çağlar. Engineer and Frontend Developer. Good developers approach their work with passion, better ones by sharing.",
    "technologies": "Technologies i used: Html, Css, Sass, Bootstrap, Tailwind Css, Vanilla JavaScript, Vue Js, React Js, Spring Boot and Git(Version Control).",
    "youtube_info_one": "Former YouTube content creator, 'Web Development Road Map', '14 Vs Code Extensions' and 'Html Crash Course' videos.",
    "youtube_info_two": "Now answers the questions 'Why you are not making a video right now?'",
    "youtube_btn": "Show YouTube Channel",
    "contact_form": "Please fill the form below for contact.",
    "contact_form_info": "First of all, thank you for wanting to contact me. I will get back to you within 24 hours at the latest. Contacting you is one of my favorite parts of my job. Because I can gain new experiences thanks to your suggestions, problems or cooperation requests.",
    "contact_form_name_surname": "Name Surname",
    "contact_form_name_placeholder": "Enter your first and last name.",
    "contact_form_email_placeholder": "Enter your email address",
    "contact_form_message": "Your message",
    "contact_form_message_placeholder": "Enter your message...",
    "contact_form_message_success": "Your message has been sent successfully.",
    "contact_form_send_message": "Send Message",
    "contact_form_name_validation": "Please enter your name and surname",
    "go_up": "Scroll to Top",
    "page_not_found": "The page you are looking for is currently unavailable.",
    "back_to_home": "Back to Homepage",
    "blog_info": "You can find all the blog posts, I've published.",
    "show_all_blog_posts": "Show All Blog Posts",
    "center_text_card_info": "How to center elements with Css",
    "center_text_image_alt": "Css Center Elements",
    "center_text_card_info_second": "In this blog post, we will look at how to center elements with Css, which we often use in Web Development.",
    "center_text_card_date": "20 Nov - 7min read",
    "center_text_blog_title": "Centering elements in Css, one of the most used things in web development.",
    "center_text_blog_desc": "In this article, I will teach you how to center elements horizontally, vertically and both horizontally and vertically.",
    "center_text_opening": "How to Center Elements Horizontally",
    "center_text_opening_desc": "First I want to start with the easier one. First let’s look at how to center a text.",
    "center_text_align_title": "How to Center Text Horizontally",
    "center_text_align": "To center a text, we use the “text-align: center” property.",
    "center_text_margin_auto": "How to Center a Div Horizontally with Margin Auto",
    "center_text_margin_auto_desc": "To center a div horizontally on a page, simply set the width of the element and the margin property to auto",
    "center_text_horizontally_flexbox": "How to Center Div Horizontally with Flexbox",
    "center_text_horizontally_flexbox_desc": "This method is what I like the most and I use it all the time. Flexbox is the most modern way to center things. All modern browsers support the flexbox feature. People think that flexbox is hard to understand but in some practice, it’s quite easy.",
    "center_text_vertically": "How to Center Elements Vertically",
    "center_text_vertically_desc": "Now, let’s look at how to center vertically. In this situation, we use flexbox. You can use Position: absolute and Transform: translate methods(Which i will not cover in this article) but this is just a cumbersome method. We do it with flexbox with only two lines of code.",
    "center_element_vertically_horizontally": "How to Center Elements Vertically and Horizontally",
    "center_element_ver_hor_transform": "How to Center Div Vertically and Horizontally with Transform: translate property",
    "center_element_ver_hor_transform_desc": "First of all you must set position relative property to parent element. Then set child element position absolute, top 50%, left 50% and transform: translate(-50%, -50%). This will center your element but you can do it with easier method.",
    "center_element_ver_hor_flexbox": "How to Center Div Vertically and Horizontally with Flexbox",
    "center_element_ver_hor_flexbox_desc": "This is the easiest method to center elements both vertically and horizontally. I use this all the time. Display flex, align-items: center, justify-content: center and you good to go.",
    "final": "Conclusion",
    "center_element_final": "That’s it everybody. Thank you for reading. You can ask questions with contact section from this site, via e-mail or social media. I will answer gladly. May the force be with you.",
    "array_methods_card_title": "5 Must Know Javascript Array Methods",
    "array_methods_card_info": "In this blog post, we will cover JavaScript Array Methods, which will make your life so much easier.",
    "array_methods_card_date": "5 Dec - 8min read",
    "array_methods_opening": "In JavaScript we use arrays all the time. In this blog post we will cover JavaScript array methods, which will make your life so much easier.",
    "array_methods_forEach": "1) forEach Array Method",
    "array_methods_forEach_desc": "ForEach method executes a given function on every element from an array.",
    "array_methods_forEach_conc": "This method gives us every fruits name individually.",
    "array_methods_map": "2) map Array Method",
    "array_methods_map_desc": "The array map method executes a given function on every element from an array and returns a new array.",
    "array_methods_map_conc": "map array method does not change the original array(numbers), So we created a new variable",
    "array_methods_filter": "3) filter Array Method",
    "array_methods_filter_desc": "The filter array method creates a new array that passes the condition we create. For example, if we want only even and odd numbers with different arrays, the filter method is the best choice. Let's see:",
    "array_methods_filter_examp": "Let’s look at another example. For example we want only adult people, ages greater equal 18.",
    "array_methods_sort": "4) sort Array Method",
    "array_methods_sort_desc": "As the name suggests, sort method sorts the elements of an array. When you sort words according to the first letter for example, it’s okay. But if you want to sort numbers, you must be careful. Because the sort method converts elements from the array to strings. Sorting numbers in an array is commonly asked from the software developer job interviews and code challenges.",
    "array_methods_slice": "5) slice Array Method",
    "array_methods_slice_desc": "The slice array method returns a shallow copy of a portion of an array. It won’t modify the original array.",
    "array_methods_slice_examp": "Let’s say we have numbers array 1 to 5 and we want elements 2 to 4 according to the index.",
    "array_methods_slice_examp_1": "In JavaScript indexes start with 0. When we use the slice method, first we write, which index we start. In our example this is 1. After that we write, which index we want lastly, we write one more than that. Which is 4. So we write slice(1, 4). This method gives us 2, 3, 4.",
    "array_methods_slice_examp_1_1": "The nice thing is with this method, it doesn’t change the original array. Therefore numbers won’t change.",
    "array_methods_slice_examp_2": "Another example is if we want the last three elements of an array. We write -3.",
    "array_methods_final": "That’s it everybody. Thank you for reading. You can ask questions with contact section from this site, via e-mail or social media. I will answer gladly. I love you all 3000."
}
